Revit 2026 API

# DGNExportOptionsGetPredefinedOptions Method

---

Returns an instance DGNExportOptions containing settings from a predefined export setup.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static DGNExportOptions GetPredefinedOptions(
	Document document,
	string setup
)
```
```vb
Public Shared Function GetPredefinedOptions (
	document As Document,
	setup As String
) As DGNExportOptions
```
```cpp
public:
static DGNExportOptions^ GetPredefinedOptions(
	Document^ document,
	String^ setup
)
```
```fsharp
static member GetPredefinedOptions :
        document : Document *
        setup : string -> DGNExportOptions
```

#### Parameters

document Document
     A Revit project document to retrieve the setup from.
setup String
     The name of a predefined export setup from the specified document.

#### Return Value

DGNExportOptions An instance of predefined DGNExportOptions, or  if the name was not found.

| Exception | Condition |
| --- | --- |
| ArgumentException | document is not a project document. |
| ArgumentNullException | A non-optional argument was null |

#### Reference

DGNExportOptions Class

Autodesk.Revit.DB Namespace